statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2978,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 316.1393552719954,
    "medianResTime" : 281.0,
    "minResTime" : 211.0,
    "maxResTime" : 2154.0,
    "pct1ResTime" : 431.0999999999999,
    "pct2ResTime" : 596.0,
    "pct3ResTime" : 1236.21,
    "throughput" : 29.87799983947347,
    "receivedKBytesPerSec" : 31.245453838590578,
    "sentKBytesPerSec" : 10.182029870475159
  },
  "List User" : {
    "transaction" : "List User",
    "sampleCount" : 2977,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 315.9744709439028,
    "medianResTime" : 281.0,
    "minResTime" : 211.0,
    "maxResTime" : 2154.0,
    "pct1ResTime" : 431.0,
    "pct2ResTime" : 596.0,
    "pct3ResTime" : 1236.2199999999998,
    "throughput" : 30.30518964920496,
    "receivedKBytesPerSec" : 31.69615050224464,
    "sentKBytesPerSec" : 10.3286242066138
  },
  "User Login" : {
    "transaction" : "User Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 807.0,
    "medianResTime" : 807.0,
    "minResTime" : 807.0,
    "maxResTime" : 807.0,
    "pct1ResTime" : 807.0,
    "pct2ResTime" : 807.0,
    "pct3ResTime" : 807.0,
    "throughput" : 1.2391573729863692,
    "receivedKBytesPerSec" : 0.8144071406443618,
    "sentKBytesPerSec" : 0.2988983116480793
  }
}