statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2983,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 318.28394233992657,
    "medianResTime" : 277.0,
    "minResTime" : 253.0,
    "maxResTime" : 1005.0,
    "pct1ResTime" : 435.7999999999997,
    "pct2ResTime" : 560.5999999999995,
    "pct3ResTime" : 775.0,
    "throughput" : 29.810921010553248,
    "receivedKBytesPerSec" : 25.296612902117648,
    "sentKBytesPerSec" : 10.159171958071834
  },
  "List User" : {
    "transaction" : "List User",
    "sampleCount" : 2982,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 318.0536552649241,
    "medianResTime" : 277.0,
    "minResTime" : 253.0,
    "maxResTime" : 900.0,
    "pct1ResTime" : 433.7000000000003,
    "pct2ResTime" : 558.6999999999998,
    "pct3ResTime" : 775.0,
    "throughput" : 30.343732828622016,
    "receivedKBytesPerSec" : 25.750687332102082,
    "sentKBytesPerSec" : 10.341760505067464
  },
  "User Login" : {
    "transaction" : "User Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1005.0,
    "medianResTime" : 1005.0,
    "minResTime" : 1005.0,
    "maxResTime" : 1005.0,
    "pct1ResTime" : 1005.0,
    "pct2ResTime" : 1005.0,
    "pct3ResTime" : 1005.0,
    "throughput" : 0.9950248756218905,
    "receivedKBytesPerSec" : 0.6539567786069652,
    "sentKBytesPerSec" : 0.24001088308457713
  }
}