statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2863,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 329.0164163464892,
    "medianResTime" : 294.0,
    "minResTime" : 248.0,
    "maxResTime" : 1111.0,
    "pct1ResTime" : 463.1999999999998,
    "pct2ResTime" : 594.7999999999997,
    "pct3ResTime" : 794.3600000000001,
    "throughput" : 28.61626419318727,
    "receivedKBytesPerSec" : 32.83114534710839,
    "sentKBytesPerSec" : 9.752008489050256
  },
  "List User" : {
    "transaction" : "List User",
    "sampleCount" : 2862,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 328.7431865828091,
    "medianResTime" : 294.0,
    "minResTime" : 248.0,
    "maxResTime" : 1000.0,
    "pct1ResTime" : 462.0,
    "pct2ResTime" : 594.0,
    "pct3ResTime" : 794.0,
    "throughput" : 29.11939767004121,
    "receivedKBytesPerSec" : 33.4133713499008,
    "sentKBytesPerSec" : 9.924482213715216
  },
  "User Login" : {
    "transaction" : "User Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1111.0,
    "medianResTime" : 1111.0,
    "minResTime" : 1111.0,
    "maxResTime" : 1111.0,
    "pct1ResTime" : 1111.0,
    "pct2ResTime" : 1111.0,
    "pct3ResTime" : 1111.0,
    "throughput" : 0.9000900090009001,
    "receivedKBytesPerSec" : 0.5915630625562557,
    "sentKBytesPerSec" : 0.21711155490549056
  }
}